virtualabs/cutcutgo/src/packs/PIC32CM5164LE00100_DFP/component/nvmctrl.h
#define NVMCTRL_SECCTRL_TAMPEEN_Pos           _UINT32_(0)                                          /* (NVMCTRL_SECCTRL) Tamper Erase Enable Position */
#define NVMCTRL_SECCTRL_TAMPEEN_Msk           (_UINT32_(0x1) << NVMCTRL_SECCTRL_TAMPEEN_Pos)       /* (NVMCTRL_SECCTRL) Tamper Erase Enable Mask */
#define NVMCTRL_SECCTRL_TAMPEEN(value)        (NVMCTRL_SECCTRL_TAMPEEN_Msk & (_UINT32_(value) << NVMCTRL_SECCTRL_TAMPEEN_Pos)) /* Assigment of value for TAMPEEN in the NVMCTRL_SECCTRL register */
#define NVMCTRL_SECCTRL_SILACC_Pos            _UINT32_(2)                                          /* (NVMCTRL_SECCTRL) Silent Access Position */
#define NVMCTRL_SECCTRL_SILACC_Msk            (_UINT32_(0x1) << NVMCTRL_SECCTRL_SILACC_Pos)        /* (NVMCTRL_SECCTRL) Silent Access Mask */
#define NVMCTRL_SECCTRL_SILACC(value)         (NVMCTRL_SECCTRL_SILACC_Msk & (_UINT32_(value) << NVMCTRL_SECCTRL_SILACC_Pos)) /* Assigment of value for SILACC in the NVMCTRL_SECCTRL register */
#define NVMCTRL_SECCTRL_TEROW_Pos             _UINT32_(8)                                          /* (NVMCTRL_SECCTRL) Tamper Rease Row Position */
#define NVMCTRL_SECCTRL_TEROW_Msk             (_UINT32_(0x7) << NVMCTRL_SECCTRL_TEROW_Pos)         /* (NVMCTRL_SECCTRL) Tamper Rease Row Mask */
#define NVMCTRL_SECCTRL_TEROW(value)          (NVMCTRL_SECCTRL_TEROW_Msk & (_UINT32_(value) << NVMCTRL_SECCTRL_TEROW_Pos)) /* Assigment of value for TEROW in the NVMCTRL_SECCTRL register */
#define NVMCTRL_SECCTRL_KEY_Pos               _UINT32_(24)                                         /* (NVMCTRL_SECCTRL) Write Key Position */
#define NVMCTRL_SECCTRL_KEY_Msk               (_UINT32_(0xFF) << NVMCTRL_SECCTRL_KEY_Pos)          /* (NVMCTRL_SECCTRL) Write Key Mask */
#define NVMCTRL_SECCTRL_KEY(value)            (NVMCTRL_SECCTRL_KEY_Msk & (_UINT32_(value) << NVMCTRL_SECCTRL_KEY_Pos)) /* Assigment of value for KEY in the NVMCTRL_SECCTRL register */
#define   NVMCTRL_SECCTRL_KEY_KEY_Val         _UINT32_(0xA5)                                       /* (NVMCTRL_SECCTRL) Write Key  */
#define NVMCTRL_SECCTRL_KEY_KEY               (NVMCTRL_SECCTRL_KEY_KEY_Val << NVMCTRL_SECCTRL_KEY_Pos) /* (NVMCTRL_SECCTRL) Write Key Position  */
#define NVMCTRL_SECCTRL_Msk                   _UINT32_(0xFF000705)                                 /* (NVMCTRL_SECCTRL) Register Mask  */


/* -------- NVMCTRL_SCFGB : (NVMCTRL Offset: 0x38) (R/W 32) Secure Boot Configuration -------- */
#define NVMCTRL_SCFGB_RESETVALUE              _UINT32_(0x03)                                       /*  (NVMCTRL_SCFGB) Secure Boot Configuration  Reset Value */

#define NVMCTRL_SCFGB_BCREN_Pos               _UINT32_(0)                                          /* (NVMCTRL_SCFGB) Boot Configuration Row Read Enable Position */
#define NVMCTRL_SCFGB_BCREN_Msk               (_UINT32_(0x1) << NVMCTRL_SCFGB_BCREN_Pos)           /* (NVMCTRL_SCFGB) Boot Configuration Row Read Enable Mask */
#define NVMCTRL_SCFGB_BCREN(value)            (NVMCTRL_SCFGB_BCREN_Msk & (_UINT32_(value) << NVMCTRL_SCFGB_BCREN_Pos)) /* Assigment of value for BCREN in the NVMCTRL_SCFGB register */
#define NVMCTRL_SCFGB_BCWEN_Pos               _UINT32_(1)                                          /* (NVMCTRL_SCFGB) Boot Configuration Row Write Enable Position */
#define NVMCTRL_SCFGB_BCWEN_Msk               (_UINT32_(0x1) << NVMCTRL_SCFGB_BCWEN_Pos)           /* (NVMCTRL_SCFGB) Boot Configuration Row Write Enable Mask */
#define NVMCTRL_SCFGB_BCWEN(value)            (NVMCTRL_SCFGB_BCWEN_Msk & (_UINT32_(value) << NVMCTRL_SCFGB_BCWEN_Pos)) /* Assigment of value for BCWEN in the NVMCTRL_SCFGB register */
#define NVMCTRL_SCFGB_Msk                     _UINT32_(0x00000003)                                 /* (NVMCTRL_SCFGB) Register Mask  */


/* -------- NVMCTRL_SCFGAD : (NVMCTRL Offset: 0x3C) (R/W 32) Secure Application and Data Configuration -------- */
#define NVMCTRL_SCFGAD_RESETVALUE             _UINT32_(0x01)                                       /*  (NVMCTRL_SCFGAD) Secure Application and Data Configuration  Reset Value */

#define NVMCTRL_SCFGAD_URWEN_Pos              _UINT32_(0)                                          /* (NVMCTRL_SCFGAD) User Row Write Enable Position */
#define NVMCTRL_SCFGAD_URWEN_Msk              (_UINT32_(0x1) << NVMCTRL_SCFGAD_URWEN_Pos)          /* (NVMCTRL_SCFGAD) User Row Write Enable Mask */
#define NVMCTRL_SCFGAD_URWEN(value)           (NVMCTRL_SCFGAD_URWEN_Msk & (_UINT32_(value) << NVMCTRL_SCFGAD_URWEN_Pos)) /* Assigment of value for URWEN in the NVMCTRL_SCFGAD register */
#define NVMCTRL_SCFGAD_Msk                    _UINT32_(0x00000001)                                 /* (NVMCTRL_SCFGAD) Register Mask  */


/** \brief NVMCTRL register offsets definitions */
#define NVMCTRL_CTRLA_REG_OFST         _UINT32_(0x00)      /* (NVMCTRL_CTRLA) Control A Offset */
#define NVMCTRL_CTRLB_REG_OFST         _UINT32_(0x04)      /* (NVMCTRL_CTRLB) Control B Offset */
#define NVMCTRL_CTRLC_REG_OFST         _UINT32_(0x08)      /* (NVMCTRL_CTRLC) Control C Offset */
#define NVMCTRL_EVCTRL_REG_OFST        _UINT32_(0x0A)      /* (NVMCTRL_EVCTRL) Event Control Offset */
#define NVMCTRL_INTENCLR_REG_OFST      _UINT32_(0x0C)      /* (NVMCTRL_INTENCLR) Interrupt Enable Clear Offset */
#define NVMCTRL_INTENSET_REG_OFST      _UINT32_(0x10)      /* (NVMCTRL_INTENSET) Interrupt Enable Set Offset */
#define NVMCTRL_INTFLAG_REG_OFST       _UINT32_(0x14)      /* (NVMCTRL_INTFLAG) Interrupt Flag Status and Clear Offset */
#define NVMCTRL_STATUS_REG_OFST        _UINT32_(0x18)      /* (NVMCTRL_STATUS) Status Offset */
#define NVMCTRL_ADDR_REG_OFST          _UINT32_(0x1C)      /* (NVMCTRL_ADDR) Address Offset */
#define NVMCTRL_SULCK_REG_OFST         _UINT32_(0x20)      /* (NVMCTRL_SULCK) Secure Unlock Register Offset */
#define NVMCTRL_NSULCK_REG_OFST        _UINT32_(0x22)      /* (NVMCTRL_NSULCK) Non-Secure Unlock Register Offset */
#define NVMCTRL_PARAM_REG_OFST         _UINT32_(0x24)      /* (NVMCTRL_PARAM) NVM Parameter Offset */
#define NVMCTRL_SECCTRL_REG_OFST       _UINT32_(0x34)      /* (NVMCTRL_SECCTRL) Security Control Offset */
#define NVMCTRL_SCFGB_REG_OFST         _UINT32_(0x38)      /* (NVMCTRL_SCFGB) Secure Boot Configuration Offset */
#define NVMCTRL_SCFGAD_REG_OFST        _UINT32_(0x3C)      /* (NVMCTRL_SCFGAD) Secure Application and Data Configuration Offset */

